app/controllers/comments_controller.rb

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("body", "link_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "hello world!!!"], ["link_id", 1], ["user_id", 1], ["created_at", "2016-06-17 13:06:55.833511"], ["updated_at", "2016-06-17 13:06:55.833511"]]
---
  def create
    @link = Link.find(params[:link_id])
    @comment = @link.comments.new(comment_params)
    @comment.user = current_user

    respond_to do |format|
      if @comment.save