app/controllers/links_controller.rb

  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "css Tricks"], ["url", "https://css-tricks.com/"], ["user_id", 1], ["created_at", "2016-06-14 08:48:42.508134"], ["updated_at", "2016-06-14 08:48:42.508134"]]

  def upvote
    @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 1]]

  def downvote
    @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 1]]